#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2019/5/7 10:02
# @Author  : legend


# 数据结构与算法之美一共73节，看了62个，后期的一些比较复杂的算法都是听了一遍，现在从头再来


"""
概念
数组（array）是一种线性表数据结构。他用一组连续的内存空间，来存出一组具有相同类型的数据
    线性表结构：数组，链表，队列，栈
    非线性表结构：二叉树，堆，图
    连续的内存空间和相同类型的数据：所以能支持随机访问，但是删除，插入数据需要有数据搬移，效率不高
    随机访问：计算机会给每个内存单元分配一个地址，计算机通过地址来访问内存中的数据。访问某个元素时，
                通过寻址公式（a[i]_address = base_address + i * data_type_size），
                计算出该元素存储的内存地址，
    数组支持随机访问，根据下标随机访问的时间复杂度为O（1）
"""
"""
时间复杂度
插入：

"""